       IDENTIFICATION DIVISION.
       PROGRAM-ID. GETSUMREF.
      * THIS IS THE GETSUM EXAMPLE WITH PARAMETERS BY REFERENCE
      * IT CHANGES THE FIRST PARAMETER
       DATA DIVISION. 
       LINKAGE SECTION. 
       01 LNUM-1  PIC 9  VALUE 5.
       01 LNUM-2  PIC 9  VALUE 4.
       01 LSUM-0  PIC 99.

       PROCEDURE DIVISION USING LNUM-1, LNUM-2, LSUM-0.
           ADD 1 TO LNUM-1.
           COMPUTE LSUM-0 = LNUM-1 + LNUM-2.
           EXIT PROGRAM.