       IDENTIFICATION DIVISION.
       PROGRAM-ID. GETSUMVAL.
      * THIS IS THE GETSUM EXAMPLE WITH PARAMETERS BY VALUE,REFERENCE
       DATA DIVISION. 
       LINKAGE SECTION. 
       01 LNUM-1  PIC 9  VALUE 5.
       01 LNUM-2  PIC 9  VALUE 4.
       01 LSUM-0  PIC 99.

       PROCEDURE DIVISION USING LNUM-1, LNUM-2, LSUM-0.
           COMPUTE LSUM-0 = LNUM-1 + LNUM-2.
           EXIT PROGRAM.