       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTALL.

      ******************************************************************
       PROCEDURE DIVISION.
           DISPLAY "TESTALL"
           CALL 'TESTCARDS'
           CALL 'TESTFOUNDATION'
           CALL 'TESTSTOCK'
           CALL 'TESTTABLEAU'
           STOP RUN.